Repository: forepath/tsef-components
Catalog: apps/frontend-tsef/src/i18n/messages.*.xlf
Languages: de

# wbCard1Title
source: Development Teams
de: Entwicklungsteams

# wbCard1Item1
source: Ship features faster with AI-powered workflows
de: Funktionen schneller liefern mit KI-gestützten Workflows

# wbCard1Item2
source: Focus on business logic, not boilerplate
de: Fokus auf Geschäftslogik statt Boilerplate

# wbCard1Item3
source: Consistent patterns across all projects
de: Konsistente Patterns in allen Projekten

# wbCard1Item4
source: Automated testing and quality gates
de: Automatisierte Tests und Quality Gates

# wbCard2Title
source: Engineering Managers
de: Engineering-Manager

# wbCard2Item1
source: Reduce onboarding time from weeks to days
de: Onboarding-Zeit von Wochen auf Tage reduzieren

# wbCard2Item2
source: Enforce quality standards automatically
de: Qualitätsstandards automatisch durchsetzen

# wbCard2Item3
source: Predictable delivery timelines
de: Planbare Lieferzeitpläne

# wbCard2Item4
source: Clear dependency boundaries
de: Klare Abhängigkeitsgrenzen

# wbCard3Title
source: CTOs & Architects
de: CTOs & Architekt:innen

# wbCard3Item1
source: Enterprise-ready from day one
de: Ab Tag eins enterprise-ready

# wbCard3Item2
source: Scalable monorepo architecture
de: Skalierbare Monorepo-Architektur

# wbCard3Item3
source: Built-in security and compliance
de: Integrierte Sicherheit und Compliance

# wbCard3Item4
source: Future-proof technology stack
de: Zukunftssicherer Technologiestack

# whyTitle
source: Why TSEF?
de: Warum TSEF?

# whyDescription
source: Enterprise development teams face <span class="text-highlight">mounting pressure</span> to deliver secure, compliant, and scalable applications at unprecedented speed. Traditional approaches lead to inconsistent quality, slow onboarding, and compliance nightmares that cost millions in technical debt and missed opportunities.
de: Enterprise-Entwicklungsteams stehen unter <span class="text-highlight">steigendem Druck</span>, sichere, konforme und skalierbare Anwendungen in beispielloser Geschwindigkeit zu liefern. Traditionelle Ansätze führen zu inkonsistenter Qualität, langsamem Onboarding und Compliance-Albträumen, die Millionen an technischer Schuld und verpassten Chancen kosten.

# whyCard1Title
source: Inconsistent Quality
de: Inkonsistente Qualität

# whyCard1SolutionTitle
source: The TSEF Solution
de: Die TSEF-Lösung

# whyCard1SolutionText
source: 200+ enforced rules, 80%+ test coverage minimum
de: 200+ durchgesetzte Regeln, mindestens 80% Testabdeckung

# whyCard2Title
source: Slow Onboarding
de: Langsames Onboarding

# whyCard2SolutionTitle
source: The TSEF Solution
de: Die TSEF-Lösung

# whyCard2SolutionText
source: AI agents guide development, 8 generators, zero-config patterns
de: KI-Agents leiten die Entwicklung, 8 Generatoren, Zero-Config-Patterns

# whyCard3Title
source: Compliance Burden
de: Compliance-Belastung

# whyCard3SolutionTitle
source: The TSEF Solution
de: Die TSEF-Lösung

# whyCard3SolutionText
source: Built-in compliance, automated monitoring, enterprise governance rules
de: Integrierte Compliance, automatisiertes Monitoring, Unternehmens-Governance-Regeln

# workflowHeroTitle
source: Transform your <span class="text-highlight">development workflow</span> with AI-powered automation
de: Transformieren Sie Ihren <span class="text-highlight">Entwicklungsworkflow</span> mit KI-gestützter Automatisierung

# workflowHeroSubtitle
source: Streamline your entire development lifecycle from <span class="text-highlight">research</span> to <span class="text-highlight">ship</span> with intelligent Cursor commands. Built on proven Nx monorepo architecture for enterprise-grade reliability.
de: Optimieren Sie Ihren gesamten Entwicklungslebenszyklus von <span class="text-highlight">Research</span> bis <span class="text-highlight">Ship</span> mit intelligenten Cursor-Befehlen. Auf bewährter Nx-Monorepo-Architektur aufgebaut für unternehmensreife Zuverlässigkeit.

# gsWorkflowTitle
source: AI-Assisted Development Workflow
de: KI-gestützter Entwicklungsworkflow

# gsWorkflowIntro
source: TSEF's streamlined workflow enhances quality and consistency. Start with <span class="text-highlight">research</span> to explore possibilities, use <span class="text-highlight">planning</span> to map strategy, <span class="text-highlight">implement</span> with precision, and <span class="text-highlight">ship</span> with confidence.
de: TSEFs optimierter Workflow steigert Qualität und Konsistenz. Beginnen Sie mit <span class="text-highlight">Recherche</span>, um Möglichkeiten zu erkunden, nutzen Sie <span class="text-highlight">Planung</span>, um Strategie zu entwickeln, <span class="text-highlight">implementieren</span> Sie präzise und <span class="text-highlight">liefern</span> Sie mit Vertrauen aus.

# workflowResearchTitle
source: 1. Research
de: 1. Recherchieren

# workflowResearchDesc
source: Explore topics deeply through multiple sources and perspectives. Synthesize findings, evaluate different approaches, and uncover potential risks and constraints. Save everything in a research file within .research/ with clear citations and actionable recommendations that guide the planning process.
de: Erkunden Sie Themen gründlich durch mehrere Quellen und Perspektiven. Fassen Sie Erkenntnisse zusammen, bewerten Sie verschiedene Ansätze und decken Sie potenzielle Risiken und Einschränkungen auf. Speichern Sie alles in einer Research-Datei innerhalb von .research/ mit klaren Zitaten und praktischen Empfehlungen, die den Planungsprozess leiten.

# workflowPlanTitle
source: 2. Plan
de: 2. Planen

# workflowPlanDesc
source: Transform research into a clear roadmap by reviewing documentation and synthesizing findings. Break down features into manageable, actionable tasks and identify the right locations within the domain structure. Leverage Nx generators to streamline setup, then document everything in .plans/ with well-defined acceptance criteria.
de: Transformieren Sie Recherche in eine klare Roadmap, indem Sie Dokumentation überprüfen und Erkenntnisse zusammenfassen. Zerlegen Sie Features in überschaubare, umsetzbare Aufgaben und identifizieren Sie die richtigen Bereiche innerhalb der Domänenstruktur. Nutzen Sie Nx-Generatoren, um das Setup zu optimieren, und dokumentieren Sie anschließend alles in .plans/ mit klar definierten Akzeptanzkriterien.

# workflowImplementTitle
source: 3. Implement
de: 3. Implementieren

# workflowImplementDesc
source: Bring plans to life by building features that align with established conventions and naming standards. Work on dedicated feature branches, commit changes with clear, focused messages, and keep documentation up to date. Prioritize quality by writing thorough tests and running the full validation suite before finalizing work.
de: Bringen Sie Pläne zum Leben, indem Sie Features entwickeln, die mit etablierten Konventionen und Namensstandards übereinstimmen. Arbeiten Sie an dedizierten Feature-Branches, erstellen Sie Commits mit klaren, fokussierten Nachrichten und halten Sie die Dokumentation aktuell. Priorisieren Sie Qualität, indem Sie gründliche Tests schreiben und die vollständige Validierungssuite ausführen, bevor Sie die Arbeit abschließen.

# workflowShipTitle
source: 4. Ship
de: 4. Ausliefern

# workflowShipDesc
source: Share work by opening pull requests with descriptive titles and filling out PR templates completely. Engage code owners and stakeholders for review, respond thoughtfully to feedback, and ensure all checks pass successfully before merging changes.
de: Teilen Sie Arbeit, indem Sie Pull Requests mit aussagekräftigen Titeln öffnen und PR-Vorlagen vollständig ausfüllen. Binden Sie Code-Owner und Stakeholder für Reviews ein, reagieren Sie umsichtig auf Feedback und stellen Sie sicher, dass alle Checks erfolgreich bestehen, bevor Sie Änderungen mergen.
