Repository: forepath/tsef-components
Catalog: apps/frontend-tsef/src/i18n/messages.*.xlf
Languages: de

# rulesMetaDescription
source: Comprehensive framework rules and guidelines for TSEF. Learn about agent guidelines, application structure, domain organization, testing strategies, security practices, and development principles.
de: Umfassende Framework-Regeln und -Richtlinien für TSEF. Erfahren Sie mehr über Agent-Richtlinien, Anwendungsstruktur, Domänenorganisation, Teststrategien, Sicherheitspraktiken und Entwicklungsprinzipien.

# rulesMetaKeywords
source: TSEF rules, framework guidelines, development standards, coding practices, testing guidelines, security rules, domain architecture, application structure, best practices
de: TSEF-Regeln, Framework-Richtlinien, Entwicklungsstandards, Coding-Praktiken, Testrichtlinien, Sicherheitsregeln, Domänenarchitektur, Anwendungsstruktur, Best Practices

# frameworkHeroTitle
source: Framework <span class="text-highlight">Rules & Guidelines</span>
de: Framework <span class="text-highlight">Regeln & Richtlinien</span>

# frameworkHeroSubtitle
source: Comprehensive <span class="text-highlight">standards and best practices</span> that ensure consistency, reliability, and maintainability across all development activities in your enterprise application.
de: Umfassende <span class="text-highlight">Standards und Best Practices</span>, die Konsistenz, Zuverlässigkeit und Wartbarkeit in allen Entwicklungsaktivitäten Ihrer Enterprise-Anwendung gewährleisten.

# rulesTitle
source: Framework Rules & Guidelines
de: Framework-Regeln & Richtlinien

# rulesIntro
source: TSEF comes with <span class="text-highlight">comprehensive rules and guidelines</span> that ensure <span class="text-highlight">consistency, reliability, and maintainability</span> across all development activities. These rules are automatically enforced and guide every aspect of your enterprise application development.
de: TSEF kommt mit <span class="text-highlight">umfassenden Regeln und Richtlinien</span>, die <span class="text-highlight">Konsistenz, Zuverlässigkeit und Wartbarkeit</span> in allen Entwicklungsaktivitäten gewährleisten. Diese Regeln werden automatisch durchgesetzt und leiten jeden Aspekt Ihrer Enterprise-Anwendungsentwicklung.

# rulesRFC2119Title
source: RFC 2119 Terminology
de: RFC 2119 Terminologie

# rulesRFC2119Text
source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in RFC 2119.
de: Die Schlüsselwörter "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD", "RECOMMENDED", "MAY" und "OPTIONAL" in diesem Dokument sind wie in RFC 2119 beschrieben zu interpretieren.

# rulesNoteTitle
source: Note
de: Hinweis

# rulesNoteText
source: These rules are automatically enforced by the framework tooling and guide every aspect of your enterprise application development.
de: Diese Regeln werden automatisch durch die Framework-Tools durchgesetzt und leiten jeden Aspekt Ihrer Enterprise-Anwendungsentwicklung.

# gsNextTitle
source: Next Steps
de: Nächste Schritte

# gsNextIntro
source: Ready to go deeper? Explore the <span class="text-highlight">documentation</span>, join the <span class="text-highlight">community</span>, or reach out for <span class="text-highlight">support</span>.
de: Bereit für mehr? Entdecken Sie die <span class="text-highlight">Dokumentation</span>, treten Sie der <span class="text-highlight">Community</span> bei oder wenden Sie sich an den <span class="text-highlight">Support</span>.

# gsNextDocs
source: Documentation
de: Dokumentation

# gsNextDocsText
source: Read guides, patterns, and reference materials.
de: Lesen Sie Anleitungen, Patterns und Referenzen.

# gsNextDocsCta
source: Browse docs
de: Dokumentation ansehen

# gsNextCommunityText
source: Get help, share ideas, and stay up to date.
de: Hilfe erhalten, Ideen teilen und auf dem Laufenden bleiben.

# gsNextCommunityCta
source: Join Discord
de: Discord beitreten

# gsNextSupportText
source: Need help with onboarding or migration?
de: Benötigen Sie Hilfe beim Onboarding oder bei der Migration?

# gsNextSupportCta
source: Contact support
de: Support kontaktieren

# headerGettingStarted
source: Getting Started
de: Erste Schritte

# headerFramework
source: Rules & Guidelines
de: Regeln & Richtlinien

# gsPrereqTitle
source: Prerequisites
de: Voraussetzungen

# gsCommandsTitle
source: Essential Nx Commands
de: Wichtige Nx-Befehle

# gsPrereqNodeText
source: Install the latest LTS release for best stability.
de: Installieren Sie die neueste LTS-Version für maximale Stabilität.

# gsPrereqGitText
source: Version control and project checkout.
de: Versionsverwaltung und Projekt-Checkout.

# gsPrereqNxText
source: Global convenience: <code>npm i -g nx</code>
de: Globaler Komfort: <code>npm i -g nx</code>

# gsPrereqDockerText
source: For containerized local development and CI.
de: Für containerisierte lokale Entwicklung und CI.

# gsTourAppsText
source: Application containers (frontend, backend, native, keycloak-theme).
de: Anwendungshüllen (Frontend, Backend, Native, Keycloak-Theme).

# gsTourLibsText
source: Domain libraries: feature, data-access, ui, util.
de: Domänen-Libraries: feature, data-access, ui, util.

# gsTourToolsText
source: Workspace scripts and custom executors.
de: Workspace-Skripte und Custom Executors.

# gsTourE2EText
source: End-to-end tests and configuration.
de: End-to-End-Tests und Konfiguration.

# gsCommandsGraphText
source: Visualize dependencies across apps and libraries.
de: Visualisieren Sie Abhängigkeiten über Apps und Libraries.

# gsCommandsAffectedText
source: Run tasks only where changes matter.
de: Führen Sie Tasks nur dort aus, wo Änderungen relevant sind.

# gsCommandsRunManyText
source: Execute a target across multiple projects.
de: Führen Sie ein Target über mehrere Projekte aus.

# gsPrereqIntro
source: The installer scripts set up most tooling automatically. For a <span class="text-highlight">smooth onboarding</span> and consistent builds, ensure these fundamentals are available on your machine before you start.
de: Die Installationsskripte richten die meisten Tools automatisch ein. Für ein <span class="text-highlight">reibungsloses Onboarding</span> und konsistente Builds stellen Sie sicher, dass diese Grundlagen auf Ihrem Rechner vorhanden sind, bevor Sie starten.

# gsTourIntro
source: Learn how your workspace is organized so new code lands in the <span class="text-highlight">right place</span> every time. Keep applications lean and reusable logic inside libraries for a maintainable monorepo.
de: Erfahren Sie, wie Ihr Workspace organisiert ist, damit neuer Code jedes Mal am <span class="text-highlight">richtigen Ort</span> landet. Halten Sie Anwendungen schlank und platzieren Sie wiederverwendbare Logik in Libraries für ein gut wartbares Monorepo.

# gsCommandsIntro
source: Your daily toolbox for fast feedback and reproducible results. Leverage Nx’s <span class="text-highlight">smart task execution</span> to visualize dependencies, run only what changed, and scale confidently across projects.
de: Ihr täglicher Werkzeugkasten für schnelles Feedback und reproduzierbare Ergebnisse. Nutzen Sie die <span class="text-highlight">intelligente Aufgabenausführung</span> von Nx, um Abhängigkeiten zu visualisieren, nur geänderte Teile auszuführen und sicher über Projekte hinweg zu skalieren.

# gettingStartedHeroTitle
source: The fastest way to an <span class="text-highlight">AI-ready</span> Nx workspace
de: Der schnellste Weg zu einem <span class="text-highlight">KI-gestützten</span> Nx-Workspace

# gettingStartedHeroSubtitle
source: <span class="text-highlight">Enterprise-grade</span> TypeScript stack with smart Nx workflows, agent-powered tooling, and built-in compliance.
de: <span class="text-highlight">Unternehmensreifer</span> TypeScript-Stack mit smarten Nx-Workflows, agentengestützten Tools und integrierter Compliance.

# cmpTitle
source: <span class="text-highlight">TSEF</span> vs Alternatives
de: <span class="text-highlight">TSEF</span> vs Alternativen

# cmpDescription
source: While other tools provide basic monorepo functionality, TSEF delivers enterprise-grade capabilities that go far beyond standard development workflows. See how TSEF compares to traditional solutions and why it's the clear choice for organizations that demand quality, compliance, and scalability.
de: Während andere Tools grundlegende Monorepo-Funktionen bieten, liefert TSEF unternehmensreife Funktionen, die weit über Standard-Entwicklungsabläufe hinausgehen. Sehen Sie, wie TSEF im Vergleich zu traditionellen Lösungen abschneidet und warum es die klare Wahl für Organisationen ist, die Qualität, Compliance und Skalierbarkeit verlangen.

# cmpHeaderFeature
source: Feature
de: Funktion

# cmpRow2
source: AI-powered agents
de: KI-gestützte Agents

# cmpRow3
source: Enterprise governance
de: Unternehmens-Governance

# cmpRow4
source: Built-in compliance
de: Integrierte Compliance

# cmpRow5
source: Test coverage enforcement
de: Durchsetzung der Testabdeckung

# cmpRow6
source: Multi-framework generators
de: Generatoren für mehrere Frameworks

# cmpBannerTitle
source: <i class="bi bi-info-circle me-2 fs-5"></i> Migration Path
de: <i class="bi bi-info-circle me-2 fs-5"></i> Migrationspfad

# cmpBannerText
source: Already using Nx? TSEF extends Nx seamlessly. Add TSEF generators to your existing workspace without breaking changes.
de: Sie verwenden bereits Nx? TSEF erweitert Nx nahtlos. Fügen Sie Ihrem bestehenden Workspace TSEF-Generatoren hinzu – ohne Breaking Changes.

# faqTitle
source: Frequently Asked Questions
de: Häufig gestellte Fragen

# faqSubtitle
source: Address common objections
de: Häufige Einwände adressieren

# faqQ1
source: Is this just Nx with extra steps?
de: Ist das nur Nx mit zusätzlichen Schritten?

# faqA1
source: TSEF extends Nx with enterprise governance, AI agents, and compliance automation that would take months to build yourself. It's Nx plus everything enterprises need for production-ready applications.
de: TSEF erweitert Nx um Unternehmens-Governance, KI-Agents und Compliance-Automatisierung, die Sie selbst Monate kosten würde. Es ist Nx plus alles, was Unternehmen für produktionsreife Anwendungen benötigen.

# faqQ2
source: What if we already use Nx?
de: Was ist, wenn wir bereits Nx verwenden?

# faqA2
source: TSEF is built on Nx. You can adopt incrementally by adding TSEF generators to your existing workspace. No breaking changes, just enhanced capabilities.
de: TSEF basiert auf Nx. Sie können schrittweise übernehmen, indem Sie Ihrem bestehenden Workspace TSEF-Generatoren hinzufügen. Keine Breaking Changes, nur erweiterte Funktionen.

# faqQ3
source: How much does it cost?
de: Wie viel kostet es?

# faqA3
source: TSEF is open source and free. No licensing fees, no vendor lock-in. You own your code and can customize everything to your needs.
de: TSEF ist Open Source und kostenlos. Keine Lizenzgebühren, kein Vendor-Lock-in. Sie besitzen Ihren Code und können alles an Ihre Bedürfnisse anpassen.

# faqQ4
source: What about vendor lock-in?
de: Wie sieht es mit Vendor-Lock-in aus?

# faqA4
source: TSEF generates standard Angular, NestJS, Ionic, and Keycloak code. You own your code and can eject anytime. No proprietary formats or dependencies.
de: TSEF generiert standardkonformen Code für Angular, NestJS, Ionic und Keycloak. Sie besitzen Ihren Code und können jederzeit aussteigen. Keine proprietären Formate oder Abhängigkeiten.

# faqQ5
source: Can we customize the rules?
de: Können wir die Regeln anpassen?

# faqA5
source: Yes. All 200+ rules are configurable. Start with defaults, customize as needed. You can add your own rules or disable ones that don't fit your organization.
de: Ja. Alle 200+ Regeln sind konfigurierbar. Starten Sie mit Standards und passen Sie bei Bedarf an. Sie können eigene Regeln hinzufügen oder solche deaktivieren, die nicht zu Ihrer Organisation passen.

# footerLegalDisclosure
source: Legal Disclosure
de: Impressum

# footerPrivacyPolicy
source: Privacy Policy
de: Datenschutzerklärung

# getStartedTitle
source: Get Started
de: Los geht’s

# getStartedDescription
source: Ready to transform your enterprise development workflow? Get started with TSEF in <span class="text-highlight">minutes, not months</span>. Our streamlined onboarding process and comprehensive documentation ensure you're productive from day one, with enterprise-grade applications running in your environment within hours.
de: Bereit, Ihren Enterprise-Entwicklungsworkflow zu transformieren? Starten Sie mit TSEF in <span class="text-highlight">Minuten statt Monaten</span>. Unser schlanker Onboarding-Prozess und umfassende Dokumentation sorgen dafür, dass Sie ab dem ersten Tag produktiv sind – mit unternehmensreifen Anwendungen in Ihrer Umgebung innerhalb weniger Stunden.

# getStartedQuickStart
source: Quick Start
de: Schnellstart

# getStartedLearnMoreWorkspace
source: Learn more about installing, updating and using TSEF in the <a routerLink="/getting-started">getting started</a> guide.
de: Erfahren Sie mehr über Installation, Updates und die Nutzung von TSEF im <a routerLink="/getting-started">Getting-Started</a>-Leitfaden.

# getStartedInstall
source: Install
de: Installieren

# getStartedInstallDescription
source: Create your first TSEF workspace in under 2 minutes.
de: Erstellen Sie Ihren ersten TSEF-Workspace in unter 2 Minuten.

# getStartedUpdate
source: Update
de: Aktualisieren

# getStartedUpdateDescription
source: Update your TSEF workspace to the latest version.
de: Aktualisieren Sie Ihren TSEF-Workspace auf die neueste Version.

# getStartedQuickStartDescription
source: Create your first TSEF workspace in under 2 minutes.
de: Erstellen Sie Ihren ersten TSEF-Workspace in unter 2 Minuten.

# getStartedViewOnGithub
source: View on GitHub
de: Auf GitHub ansehen

# getStartedJoinCommunity
source: Join Community
de: Community beitreten

# getStartedGetSupport
source: Get Support
de: Support erhalten

# headerDocs
source: Documentation
de: Dokumentation

# heroTitle
source: The <span class="text-highlight">AI-ready</span> TypeScript Enterprise Framework
de: Das <span class="text-highlight">KI-gestützte</span> TypeScript Enterprise Framework

# heroSubtitle
source: <span class="text-highlight">Enterprise-grade</span> Nx workflow with AI-powered development agents and built-in compliance.
de: <span class="text-highlight">Unternehmensreifer</span> Nx-Workflow mit KI-gestützten Entwicklungs-Agents und integrierter Compliance.

# heroBullet1
source: <strong>AI-powered agents</strong> for automated development workflows
de: <strong>KI-gestützte Agents</strong> für automatisierte Entwicklungs-Workflows

# heroBullet2
source: <strong>80%+ test coverage</strong> enforced automatically
de: <strong>80%+ Testabdeckung</strong> wird automatisch durchgesetzt

# heroBullet4
source: <strong>8 generators</strong> for Angular, NestJS, Ionic, Keycloak
de: <strong>8 Generatoren</strong> für Angular, NestJS, Ionic, Keycloak

# heroBullet5
source: <strong>4 frameworks</strong> in single monorepo
de: <strong>4 Frameworks</strong> in einem Monorepo

# heroBullet6
source: <strong>200+ rules</strong> for enterprise compliance
de: <strong>200+ Regeln</strong> für Enterprise-Compliance

# heroBannerTitle
source: <i class="bi bi-arrow-right-circle me-2"></i>Beyond Standard Nx
de: <i class="bi bi-arrow-right-circle me-2"></i>Über Standard-Nx hinaus

# heroBannerText
source: While Nx provides monorepo tooling, TSEF adds enterprise governance, AI-powered workflows, and built-in compliance for production-ready applications.
de: Während Nx Monorepo-Tools bereitstellt, ergänzt TSEF Unternehmens-Governance, KI-gestützte Workflows und integrierte Compliance für produktionsreife Anwendungen.

# heroCtaGetStarted
source: Get Started
de: Jetzt starten

# heroCtaViewOnGithub
source: View on GitHub
de: Auf GitHub ansehen

# homeMetaDescription
source: TSEF is the AI-ready TypeScript Enterprise Framework. Easily build, deploy, and scale modern enterprise applications with best practices, advanced tooling, and AI capabilities out of the box.
de: TSEF ist das KI-gestützte TypeScript Enterprise Framework. Erstellen, deployen und skalieren Sie mühelos moderne Enterprise-Anwendungen mit Best Practices, fortschrittlichen Tools und KI-Funktionen out-of-the-box.

# homeMetaKeywords
source: TSEF, TypeScript, Enterprise Framework, AI-ready, Angular, web development, scalable, application framework, cloud, modern apps, enterprise solutions, software tools, best practices
de: TSEF, TypeScript, Enterprise Framework, KI-bereit, Angular, Webentwicklung, skalierbar, Anwendungsframework, Cloud, moderne Apps, Enterprise-Lösungen, Software-Tools, Best Practices

# hiwTitle
source: How It Works
de: So funktioniert es

# hiwDescription
source: TSEF transforms enterprise development through a <span class="text-highlight">streamlined</span> three-step process that eliminates complexity while ensuring enterprise-grade quality. From intelligent code generation to automated deployment, every step is guided by AI agents and enforced by 200+ enterprise rules.
de: TSEF transformiert die Enterprise-Entwicklung durch einen <span class="text-highlight">vereinfachten</span> Drei-Schritte-Prozess, der Komplexität eliminiert und gleichzeitig Qualität auf Unternehmensniveau sicherstellt. Von intelligenter Codegenerierung bis zur automatisierten Bereitstellung – jeder Schritt wird von KI-Agents geführt und durch 200+ Enterprise-Regeln abgesichert.

# hiwStep1
source: Generate
de: Generieren

# hiwStep1Item1
source: Run a generator (frontend, backend, native, keycloak-theme)
de: Führen Sie einen Generator aus (Frontend, Backend, Native, Keycloak-Theme)

# hiwStep1Item2
source: AI agents scaffold enterprise-grade code
de: KI-Agents erstellen Gerüste für Code in Unternehmensqualität

# hiwStep1Item3
source: Domain-driven structure automatically created
de: Domänengetriebene Struktur wird automatisch erstellt

# hiwStep2
source: Develop
de: Entwickeln

# hiwStep2Item1
source: AI agents enforce 200+ enterprise rules
de: KI-Agents setzen 200+ Unternehmensregeln durch

# hiwStep2Item2
source: Automated testing ensures 80% coverage
de: Automatisierte Tests stellen 80% Abdeckung sicher

# hiwStep2Item3
source: Real-time compliance validation
de: Echtzeit-Compliance-Validierung

# hiwStep2Item4
source: Zero-config patterns guide best practices
de: Zero-Config-Patterns leiten Best Practices

# hiwStep3
source: Deploy
de: Bereitstellen

# hiwStep3Item1
source: Containerized applications ready to ship
de: Containerisierte Anwendungen sind einsatzbereit

# hiwStep3Item2
source: Infrastructure as code included
de: Infrastructure as Code inklusive

# hiwStep3Item3
source: Monitoring and observability built-in
de: Monitoring und Observability integriert

# hiwStep3Item4
source: Disaster recovery procedures documented
de: Notfallwiederherstellungsprozesse dokumentiert

# proofTitle
source: Proven Results
de: Bewährte Ergebnisse

# proofDescription
source: TSEF delivers measurable outcomes backed by concrete metrics and enterprise-grade capabilities. Every number represents real value delivered to development teams, from automated code generation to enforced quality standards.
de: TSEF liefert messbare Ergebnisse, gestützt durch konkrete Kennzahlen und Funktionen auf Unternehmensniveau. Jede Zahl steht für echten Mehrwert für Entwicklungsteams – von automatischer Codegenerierung bis hin zu durchgesetzten Qualitätsstandards.

# proofMetric8Caption
source: Generators covering all application types
de: Generatoren für alle Anwendungstypen

# proofMetric4Caption
source: Frameworks seamlessly integrated
de: Nahtlos integrierte Frameworks

# proofMetric200Caption
source: Enterprise rules enforced
de: Unternehmensregeln durchgesetzt

# proofMetric80Caption
source: Test coverage guaranteed
de: Testabdeckung garantiert

# proofBannerTitle
source: <i class="bi bi-github me-2 fs-5"></i> Open Source & Community Driven
de: <i class="bi bi-github me-2 fs-5"></i> Open Source & Community-getrieben

# proofBannerText
source: TSEF is built by developers, for developers. Contribute, customize, and own your code.
de: TSEF wird von Entwicklern für Entwickler gebaut. Tragen Sie bei, passen Sie an und besitzen Sie Ihren Code.

# technologyTitle
source: Powered by the <span class="text-highlight">industry's favorite technologies</span>
de: Angetrieben von den <span class="text-highlight">Lieblingstechnologien der Branche</span>

# wygTitle
source: What You Get
de: Was Sie erhalten

# wygDescription
source: TSEF provides a <span class="text-highlight">comprehensive</span> enterprise development platform that combines AI-powered automation with proven frameworks and governance. Every feature is designed to accelerate development while maintaining the highest standards of quality, security, and compliance.
de: TSEF bietet eine <span class="text-highlight">umfassende</span> Enterprise-Entwicklungsplattform, die KI-gestützte Automatisierung mit bewährten Frameworks und Governance kombiniert. Jede Funktion ist darauf ausgelegt, die Entwicklung zu beschleunigen und gleichzeitig höchste Standards bei Qualität, Sicherheit und Compliance einzuhalten.

# wygCard1Title
source: AI-Powered Development
de: KI-gestützte Entwicklung

# wygCard1Item1
source: Intelligent code generation
de: Intelligente Codegenerierung

# wygCard1Item2
source: Automated testing and validation
de: Automatisiertes Testen und Validieren

# wygCard1Item3
source: Real-time compliance checking
de: Echtzeit-Compliance-Prüfung

# wygCard1Item4
source: Context-aware suggestions
de: Kontextbezogene Vorschläge

# wygCard2Title
source: Multi-Framework Monorepo
de: Monorepo mit mehreren Frameworks

# wygCard2Item1
source: Angular for web applications
de: Angular für Webanwendungen

# wygCard2Item2
source: Clarity and Bootstrap for UX/UI
de: Clarity und Bootstrap für UX/UI

# wygCard2Item3
source: NestJS for backend services
de: NestJS für Backend-Services

# wygCard2Item4
source: Ionic for mobile apps
de: Ionic für mobile Apps

# wygCard2Item5
source: Keycloak for authentication
de: Keycloak für Authentifizierung

# wygCard3Item1
source: 200+ rules for consistency
de: 200+ Regeln für Konsistenz

# wygCard3Item2
source: Dependency boundary enforcement
de: Durchsetzung von Abhängigkeitsgrenzen

# wygCard3Item3
source: Security best practices
de: Sicherheitsbest Practices

# wygCard3Item4
source: Compliance automation (GDPR, CCPA)
de: Compliance-Automatisierung (DSGVO, CCPA)

# wygCard4Title
source: Production-Ready Infrastructure
de: Produktionsreife Infrastruktur

# wygCard4Item1
source: Docker containerization
de: Docker-Containerisierung

# wygCard4Item2
source: Kubernetes deployment configs
de: Kubernetes-Bereitstellungskonfigurationen

# wygCard4Item3
source: CI/CD pipeline templates
de: CI/CD-Pipelinevorlagen

# wygCard4Item4
source: Monitoring and alerting
de: Monitoring und Alarmierung

# wbTitle
source: Who Benefits?
de: Wer profitiert?

# wbDescription
source: TSEF delivers <span class="text-highlight">measurable value</span> across every level of your organization. From developers writing their first line of code to CTOs making strategic technology decisions, everyone benefits from standardized, enterprise-grade development practices that accelerate delivery while reducing risk and technical debt.
de: TSEF liefert <span class="text-highlight">messbaren Mehrwert</span> auf allen Ebenen Ihrer Organisation. Von Entwicklerinnen und Entwicklern der ersten Codezeile bis zu CTOs mit strategischen Technologieentscheidungen profitieren alle von standardisierten, enterprise-tauglichen Entwicklungspraktiken, die die Lieferung beschleunigen und gleichzeitig Risiko und technische Schulden reduzieren.
